Функция СформироватьJSONПланшетНаСервере(Знач ДатаНачала, Знач ДатаОкончания)
Дата1 = ?(ЗначениеЗаполнено(ДатаНачала), НачалоДня(ДатаНачала), Дата(Год(ТекущаяДата()), 1, 1));
Дата2 = ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), Дата(2050, 1, 1));

лЗапрос = Новый Запрос;
лЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

лЗапрос.Текст = "ВЫБРАТЬ
|    eamЗаказНаряды.Ссылка КАК Ссылка,
|    eamЗаказНаряды.Номер КАК Номер,
|    eamЗаказНаряды.Дата КАК Дата,
|    eamЗаказНаряды.т1кСдалВПриемку КАК т1кСдалВПриемку,
|    eamЗаказНаряды.т1кПринялВПриемку КАК т1кПринялВПриемку,
|    eamЗаказНаряды.т1кДатаПриемки КАК т1кДатаПриемки,
|    eamЗаказНаряды.т1кВыдал КАК т1кВыдал,
|    eamЗаказНаряды.т1кПринялВыдача КАК т1кПринялВыдача,
|    eamЗаказНаряды.т1кДатаВыдачи КАК т1кДатаВыдачи,
|    eamЗаказНаряды.ТипЗаказНаряда КАК СсылкаТипЗаказНаряда,
|    eamЗаказНаряды.т1кПостРемзоны.Родитель КАК ПостРемзоны,
|    eamЗаказНаряды.ОбъектОФ.т1кТСиОборудование.уатМодель.ВидМоделиТС КАК ВидМоделиТС,
|    ВЫРАЗИТЬ(eamЗаказНаряды.ДокументОснование КАК Документ.eamОбнаруженныйДефект).шхКлассификаторДефекта КАК ДокументОснованиешхКлассификаторДефекта,
|    ВЫРАЗИТЬ(eamЗаказНаряды.ДокументОснование КАК Документ.eamОбнаруженныйДефект).т1кОписание КАК ДокументОснованиет1кОписание,
|    eamЗаказНаряды.Подразделение КАК Подразделение,
|    eamЗаказНаряды.Статус КАК СтатусДок,
|    eamЗаказНаряды.т1кГруппаТехники КАК т1кГруппаТехники,
|    eamЗаказНаряды.т1кГаражныйНомер КАК т1кГаражныйНомер,
|    eamЗаказНаряды.ДлительностьЧасы КАК ДлительностьЧасы,
|    eamЗаказНаряды.т1кГодВыпуска КАК т1кГодВыпуска,
|    eamЗаказНаряды.т1кСектор КАК т1кСектор,
|    eamЗаказНаряды.ОбъектОФ КАК ОбъектОФ
|ПОМЕСТИТЬ втЗН0_База
|ИЗ
|    Документ.eamЗаказНаряды КАК eamЗаказНаряды
|ГДЕ
|    eamЗаказНаряды.Дата МЕЖДУ &Дата1 И &Дата2
|    И eamЗаказНаряды.Проведен
|    И eamЗаказНаряды.ОбъектОФ.т1кТСиОборудование.уатМодель.ВидМоделиТС В(&Вид)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|// ОПТИМИЗАЦИЯ: Использованы правильные реквизиты ТЧ без лишнего приведения типов
|ВЫБРАТЬ ТЧ.Ссылка КАК Ссылка, СУММА(ТЧ.Стоимость) КАК Стоимость ПОМЕСТИТЬ втМат ИЗ Документ.eamЗаказНаряды.Материалы КАК ТЧ ГДЕ ТЧ.Ссылка В (ВЫБРАТЬ Ссылка ИЗ втЗН0_База) СГРУППИРОВАТЬ ПО ТЧ.Ссылка;
|ВЫБРАТЬ ТЧ.Ссылка КАК Ссылка, СУММА(ТЧ.т1кЧасыЧисло) КАК Часы ПОМЕСТИТЬ втТруд ИЗ Документ.eamЗаказНаряды.Трудозатраты КАК ТЧ ГДЕ ТЧ.Ссылка В (ВЫБРАТЬ Ссылка ИЗ втЗН0_База) СГРУППИРОВАТЬ ПО ТЧ.Ссылка;
|
|////////////////////////////////////////////////////////////////////////////////
|// ОПТИМИЗАЦИЯ: Срез последних статусов
|ВЫБРАТЬ Рег.Объект КАК Объект, МАКСИМУМ(Рег.Период) КАК Период ПОМЕСТИТЬ втМаксСтат ИЗ РегистрСведений.eamСтатусыОбъектов КАК Рег ГДЕ Рег.Объект В (ВЫБРАТЬ Ссылка ИЗ втЗН0_База) СГРУППИРОВАТЬ ПО Рег.Объект;
|ВЫБРАТЬ Макс.Объект КАК Объект, Рег.Статус КАК Статус, Макс.Период КАК Период ПОМЕСТИТЬ втТекСтат ИЗ втМаксСтат КАК Макс ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.eamСтатусыОбъектов КАК Рег ПО Макс.Объект = Рег.Объект И Макс.Период = Рег.Период;
|
|////////////////////////////////////////////////////////////////////////////////
|// ОПТИМИЗАЦИЯ: Срез последних счетчиков
|ВЫБРАТЬ Рег.ТС КАК ТС, Рег.ТипСчетчика КАК ТипСчетчика, МАКСИМУМ(Рег.Период) КАК Период ПОМЕСТИТЬ втМаксСчет ИЗ РегистрСведений.уатСчетчикиТС КАК Рег ГДЕ Рег.ТС В (ВЫБРАТЬ ОбъектОФ ИЗ втЗН0_База) СГРУППИРОВАТЬ ПО Рег.ТС, Рег.ТипСчетчика;
|ВЫБРАТЬ Макс.ТС КАК ТС, Макс.ТипСчетчика КАК ТипСчетчика, Рег.Значение КАК Значение ПОМЕСТИТЬ втТекСчет ИЗ втМаксСчет КАК Макс ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатСчетчикиТС КАК Рег ПО Макс.ТС = Рег.ТС И Макс.Период = Рег.Период И Макс.ТипСчетчика = Рег.ТипСчетчика;
|
|////////////////////////////////////////////////////////////////////////////////
|// СБОРКА ОСНОВНОЙ ВРЕМЕННОЙ ТАБЛИЦЫ
|ВЫБРАТЬ
|    Б.*,
|    ЕСТЬNULL(М.Стоимость, 0) КАК СтоимостьМатериалов,
|    ЕСТЬNULL(Т.Часы, 0) КАК ЧасыТрудозатрат,
|    ВЫБОР КОГДА СТ.Статус = &СтатусЗакрыт ТОГДА СТ.Период ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ КАК ЗНЗакрыт,
|    ЕСТЬNULL(Спид.Значение, 0) КАК Спидометр,
|    ЕСТЬNULL(Мот.Значение, 0) КАК СчетчикМЧ
|ПОМЕСТИТЬ втЗН0
|ИЗ
|    втЗН0_База КАК Б
|    ЛЕВОЕ СОЕДИНЕНИЕ втМат КАК М ПО Б.Ссылка = М.Ссылка
|    ЛЕВОЕ СОЕДИНЕНИЕ втТруд КАК Т ПО Б.Ссылка = Т.Ссылка
|    ЛЕВОЕ СОЕДИНЕНИЕ втТекСтат КАК СТ ПО Б.Ссылка = СТ.Объект
|    ЛЕВОЕ СОЕДИНЕНИЕ втТекСчет КАК Спид ПО Б.ОбъектОФ = Спид.ТС И Спид.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.уатТипыСчетчиковТС.Спидометр)
|    ЛЕВОЕ СОЕДИНЕНИЕ втТекСчет КАК Мот ПО Б.ОбъектОФ = Мот.ТС И Мот.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.уатТипыСчетчиковТС.СчетчикМЧ)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|    eamЗаказНаряды.Ссылка КАК Ссылка,
|    eamЗаказНаряды.Номер КАК Номер,
|    eamЗаказНаряды.Дата КАК Дата,
|    &СтатусГотовКПриемке КАК ГотовК,
|    ""ДГМ"" КАК Дирекция,
|    eamЗаказНаряды.т1кДатаПриемки КАК ДатаСтатуса,
|    eamЗаказНаряды.т1кПринялВПриемку КАК Сотрудник,
|    eamЗаказНаряды.СсылкаТипЗаказНаряда КАК СсылкаТипЗаказНаряда,
|    eamЗаказНаряды.ПостРемзоны КАК ПостРемзоны,
|    eamЗаказНаряды.ВидМоделиТС КАК ВидМоделиТС,
|    eamЗаказНаряды.ДокументОснованиешхКлассификаторДефекта КАК ДокументОснованиешхКлассификаторДефекта,
|    eamЗаказНаряды.ДокументОснованиет1кОписание КАК ДокументОснованиет1кОписание,
|    eamЗаказНаряды.Подразделение КАК Подразделение,
|    eamЗаказНаряды.СтатусДок КАК СтатусДок,
|    eamЗаказНаряды.т1кГруппаТехники КАК т1кГруппаТехники,
|    eamЗаказНаряды.т1кГаражныйНомер КАК т1кГаражныйНомер,
|    eamЗаказНаряды.ДлительностьЧасы КАК ДлительностьЧасы,
|    eamЗаказНаряды.т1кГодВыпуска КАК т1кГодВыпуска,
|    eamЗаказНаряды.т1кСектор КАК т1кСектор,
|    eamЗаказНаряды.ОбъектОФ КАК ОбъектОФ,
|    eamЗаказНаряды.СтоимостьМатериалов КАК СтоимостьМатериалов,
|    eamЗаказНаряды.ЧасыТрудозатрат КАК ЧасыТрудозатрат,
|    eamЗаказНаряды.ЗНЗакрыт КАК ЗНЗакрыт,
|    eamЗаказНаряды.Спидометр КАК Спидометр,
|    eamЗаказНаряды.СчетчикМЧ КАК СчетчикМЧ
|ПОМЕСТИТЬ втЗН
|ИЗ втЗН0 КАК eamЗаказНаряды
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|    eamЗаказНаряды.Ссылка,
|    eamЗаказНаряды.Номер,
|    eamЗаказНаряды.Дата,
|    &СтатусГотовКВыдаче,
|    ""ДГМ"",
|    eamЗаказНаряды.т1кДатаВыдачи,
|    eamЗаказНаряды.т1кВыдал,
|    eamЗаказНаряды.СсылкаТипЗаказНаряда,
|    eamЗаказНаряды.ПостРемзоны,
|    eamЗаказНаряды.ВидМоделиТС,
|    eamЗаказНаряды.ДокументОснованиешхКлассификаторДефекта,
|    eamЗаказНаряды.ДокументОснованиет1кОписание,
|    eamЗаказНаряды.Подразделение,
|    eamЗаказНаряды.СтатусДок,
|    eamЗаказНаряды.т1кГруппаТехники,
|    eamЗаказНаряды.т1кГаражныйНомер,
|    eamЗаказНаряды.ДлительностьЧасы,
|    eamЗаказНаряды.т1кГодВыпуска,
|    eamЗаказНаряды.т1кСектор,
|    eamЗаказНаряды.ОбъектОФ,
|    eamЗаказНаряды.СтоимостьМатериалов,
|    eamЗаказНаряды.ЧасыТрудозатрат,
|    eamЗаказНаряды.ЗНЗакрыт,
|    eamЗаказНаряды.Спидометр,
|    eamЗаказНаряды.СчетчикМЧ
|ИЗ втЗН0 КАК eamЗаказНаряды
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|    eamЗаказНаряды.Ссылка,
|    eamЗаказНаряды.Номер,
|    eamЗаказНаряды.Дата,
|    &СтатусГотовКПриемке,
|    ""ДЭНТ"",
|    eamЗаказНаряды.т1кДатаПриемки,
|    eamЗаказНаряды.т1кСдалВПриемку,
|    eamЗаказНаряды.СсылкаТипЗаказНаряда,
|    eamЗаказНаряды.ПостРемзоны,
|    eamЗаказНаряды.ВидМоделиТС,
|    eamЗаказНаряды.ДокументОснованиешхКлассификаторДефекта,
|    eamЗаказНаряды.ДокументОснованиет1кОписание,
|    eamЗаказНаряды.Подразделение,
|    eamЗаказНаряды.СтатусДок,
|    eamЗаказНаряды.т1кГруппаТехники,
|    eamЗаказНаряды.т1кГаражныйНомер,
|    eamЗаказНаряды.ДлительностьЧасы,
|    eamЗаказНаряды.т1кГодВыпуска,
|    eamЗаказНаряды.т1кСектор,
|    eamЗаказНаряды.ОбъектОФ,
|    eamЗаказНаряды.СтоимостьМатериалов,
|    eamЗаказНаряды.ЧасыТрудозатрат,
|    eamЗаказНаряды.ЗНЗакрыт,
|    eamЗаказНаряды.Спидометр,
|    eamЗаказНаряды.СчетчикМЧ
|ИЗ втЗН0 КАК eamЗаказНаряды
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|    eamЗаказНаряды.Ссылка,
|    eamЗаказНаряды.Номер,
|    eamЗаказНаряды.Дата,
|    &СтатусГотовКВыдаче,
|    ""ДЭНТ"",
|    eamЗаказНаряды.т1кДатаВыдачи,
|    eamЗаказНаряды.т1кПринялВыдача,
|    eamЗаказНаряды.СсылкаТипЗаказНаряда,
|    eamЗаказНаряды.ПостРемзоны,
|    eamЗаказНаряды.ВидМоделиТС,
|    eamЗаказНаряды.ДокументОснованиешхКлассификаторДефекта,
|    eamЗаказНаряды.ДокументОснованиет1кОписание,
|    eamЗаказНаряды.Подразделение,
|    eamЗаказНаряды.СтатусДок,
|    eamЗаказНаряды.т1кГруппаТехники,
|    eamЗаказНаряды.т1кГаражныйНомер,
|    eamЗаказНаряды.ДлительностьЧасы,
|    eamЗаказНаряды.т1кГодВыпуска,
|    eamЗаказНаряды.т1кСектор,
|    eamЗаказНаряды.ОбъектОФ,
|    eamЗаказНаряды.СтоимостьМатериалов,
|    eamЗаказНаряды.ЧасыТрудозатрат,
|    eamЗаказНаряды.ЗНЗакрыт,
|    eamЗаказНаряды.Спидометр,
|    eamЗаказНаряды.СчетчикМЧ
|ИЗ втЗН0 КАК eamЗаказНаряды
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|    втЗН.Ссылка КАК Ссылка,
|    втЗН.Номер КАК Номер,
|    втЗН.Дата КАК Дата,
|    втЗН.ГотовК КАК ГотовК,
|    втЗН.Дирекция КАК Дирекция,
|    втЗН.ДатаСтатуса КАК ДатаСтатуса,
|    втЗН.Сотрудник КАК Сотрудник,
|    ВЫБОР
|        КОГДА втЗН.ДатаСтатуса = &ДатаСтатусаПустая
|            ТОГДА ""НЕ ПОДПИСАНО""
|        КОГДА МАКСИМУМ(шхОтметкиЧекинВЗаказНарядах.Пользователь) ЕСТЬ NULL
|            ТОГДА ""ПК""
|        ИНАЧЕ ""ПЛАНШЕТ""
|    КОНЕЦ КАК АРМ,
|    ВЫБОР
|        КОГДА МАКСИМУМ(шхОтметкиЧекинВЗаказНарядах.Период) < &Дата1
|            ТОГДА ИСТИНА
|        ИНАЧЕ ЛОЖЬ
|    КОНЕЦ КАК ВГраницеОтбора,
|    втЗН.ПостРемзоны КАК ПостРемзоны,
|    ДЕНЬ(втЗН.ДатаСтатуса) КАК ДЕНЬ_Статус,
|    МЕСЯЦ(втЗН.ДатаСтатуса) КАК МЕСЯЦ_Статус,
|    ГОД(втЗН.ДатаСтатуса) КАК ГОД_Статус,
|    НЕДЕЛЯ(втЗН.ДатаСтатуса) КАК НЕДЕЛЯ_Статус,
|    втЗН.СсылкаТипЗаказНаряда КАК СсылкаТипЗаказНаряда,
|    ВЫБОР
|        КОГДА втЗН.Сотрудник.Подразделение В (&ДГМ)
|            ТОГДА ""ДГМ""
|        КОГДА втЗН.Сотрудник.Подразделение В (&ДЭНТ)
|            ТОГДА ""ДЭНТ""
|        КОГДА втЗН.Сотрудник.Подразделение ЕСТЬ NULL
|            ТОГДА """"
|        ИНАЧЕ ""?""
|    КОНЕЦ КАК СотрудникПодр,
|    втЗН.ВидМоделиТС КАК СсылкаОбъектОФт1кТСиОборудованиеуатМодельВидМоделиТС,
|    втЗН.ДокументОснованиешхКлассификаторДефекта КАК ДокументОснованиешхКлассификаторДефекта,
|    втЗН.ДокументОснованиет1кОписание КАК ДокументОснованиет1кОписание,
|    втЗН.Подразделение КАК Подразделение,
|    втЗН.СтатусДок КАК СтатусДок,
|    втЗН.т1кГруппаТехники КАК т1кГруппаТехники,
|    втЗН.т1кГаражныйНомер КАК т1кГаражныйНомер,
|    втЗН.ДлительностьЧасы КАК ДлительностьЧасы,
|    втЗН.т1кГодВыпуска КАК т1кГодВыпуска,
|    втЗН.т1кСектор КАК т1кСектор,
|    втЗН.ОбъектОФ КАК ОбъектОФ,
|    втЗН.СтоимостьМатериалов КАК СтоимостьМатериалов,
|    втЗН.ЧасыТрудозатрат КАК ЧасыТрудозатрат,
|    втЗН.ЗНЗакрыт КАК ЗНЗакрыт,
|    втЗН.Спидометр КАК Спидометр,
|    втЗН.СчетчикМЧ КАК СчетчикМЧ
|ИЗ
|    втЗН КАК втЗН
|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.шхОтметкиЧекинВЗаказНарядах КАК шхОтметкиЧекинВЗаказНарядах
|        ПО (шхОтметкиЧекинВЗаказНарядах.ЗаказНаряд = втЗН.Ссылка)
|            И (шхОтметкиЧекинВЗаказНарядах.Статус = втЗН.ГотовК)
|            И (шхОтметкиЧекинВЗаказНарядах.Пользователь = втЗН.Сотрудник)
|
|СГРУППИРОВАТЬ ПО
|    втЗН.Ссылка,
|    втЗН.Номер,
|    втЗН.Дата,
|    втЗН.ГотовК,
|    втЗН.Дирекция,
|    втЗН.ДатаСтатуса,
|    втЗН.Сотрудник,
|    втЗН.ПостРемзоны,
|    втЗН.СсылкаТипЗаказНаряда,
|    втЗН.ВидМоделиТС,
|    втЗН.ДокументОснованиешхКлассификаторДефекта,
|    втЗН.ДокументОснованиет1кОписание,
|    втЗН.Подразделение,
|    втЗН.СтатусДок,
|    втЗН.т1кГруппаТехники,
|    втЗН.т1кГаражныйНомер,
|    втЗН.ДлительностьЧасы,
|    втЗН.т1кГодВыпуска,
|    втЗН.т1кСектор,
|    втЗН.ОбъектОФ,
|    втЗН.СтоимостьМатериалов,
|    втЗН.ЧасыТрудозатрат,
|    втЗН.ЗНЗакрыт,
|    втЗН.Спидометр,
|    втЗН.СчетчикМЧ,
|    ВЫБОР
|        КОГДА втЗН.Сотрудник.Подразделение В (&ДГМ)
|            ТОГДА ""ДГМ""
|        КОГДА втЗН.Сотрудник.Подразделение В (&ДЭНТ)
|            ТОГДА ""ДЭНТ""
|        КОГДА втЗН.Сотрудник.Подразделение ЕСТЬ NULL
|            ТОГДА """"
|        ИНАЧЕ ""?""
|    КОНЕЦ
|
|УПОРЯДОЧИТЬ ПО
|    ДатаСтатуса";

лЗапрос.УстановитьПараметр("Дата1", Дата1);
лЗапрос.УстановитьПараметр("Дата2", Дата2);
лЗапрос.УстановитьПараметр("ДатаСтатусаПустая", Дата(1, 1, 1, 0, 0, 0));

Вид = Новый Массив;
Вид.Добавить(Перечисления.уатВидыМоделейТС.Автотранспорт);
лЗапрос.УстановитьПараметр("Вид", Вид);

лЗапрос.УстановитьПараметр("СтатусГотовКПриемке", Справочники.eamСтатусыОбъектов.НайтиПоНаименованию("Готов к приемке"));
лЗапрос.УстановитьПараметр("СтатусГотовКВыдаче", Справочники.eamСтатусыОбъектов.НайтиПоНаименованию("Готов к выбытию"));
лЗапрос.УстановитьПараметр("СтатусЗакрыт", Справочники.eamСтатусыОбъектов.НайтиПоКоду( "000000026"));

ДЭНТ = Новый Массив;
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Дирекция эксплуатации наземной техники"));
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба водителей спец. и доставки СНО"));
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба технического планирования"));
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба проверки и выпуска техники"));
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Отдел договорной работы"));
ДЭНТ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба доставки пассажиров (ДЭНТ)"));
лЗапрос.УстановитьПараметр("ДЭНТ", ДЭНТ);

ДГМ = Новый Массив;
ДГМ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба ремонта техники и средств наземного обслуживания"));
ДГМ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Дирекция главного механика"));
ДГМ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Служба контроля технического обслуживания и ремонта спецтехники и СНО"));
ДГМ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Отдел заправки средств перронной механизации"));
ДГМ.Добавить(Справочники.СтруктураПредприятия.НайтиПоНаименованию("Отдел договорной работы"));
лЗапрос.УстановитьПараметр("ДГМ", ДГМ);

Результат = лЗапрос.Выполнить();
Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли;

Поток = Новый ПотокВПамяти();
ЗаписьJSON = Новый ЗаписьJSON;
ЗаписьJSON.ОткрытьПоток(Поток, , , Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина));
ЗаписьJSON.ЗаписатьНачалоМассива();

КоличествоЗаписей = 0;
лВыборка = Результат.Выбрать();

Пока лВыборка.Следующий() Цикл
    КоличествоЗаписей = КоличествоЗаписей + 1;
    ЗаписьJSON.ЗаписатьНачалоОбъекта();

    ЗаписьJSON.ЗаписатьИмяСвойства("number"); ЗаписьJSON.ЗаписатьЗначение(СокрЛП(лВыборка.Номер));
    ЗаписьJSON.ЗаписатьИмяСвойства("date"); ЗаписьJSON.ЗаписатьЗначение(Формат(лВыборка.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss"));
    ЗаписьJSON.ЗаписатьИмяСвойства("ready_for"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.ГотовК));
    ЗаписьJSON.ЗаписатьИмяСвойства("direction"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.Дирекция));
    ЗаписьJSON.ЗаписатьИмяСвойства("status_date"); ЗаписьJSON.ЗаписатьЗначение(Формат(лВыборка.ДатаСтатуса, "ДФ=yyyy-MM-ddTHH:mm:ss"));
    ЗаписьJSON.ЗаписатьИмяСвойства("employee"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.Сотрудник));
    ЗаписьJSON.ЗаписатьИмяСвойства("arm"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.АРМ));
    ЗаписьJSON.ЗаписатьИмяСвойства("post"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.ПостРемзоны));
    ЗаписьJSON.ЗаписатьИмяСвойства("day_status"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.ДЕНЬ_Статус);
    ЗаписьJSON.ЗаписатьИмяСвойства("month_status"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.МЕСЯЦ_Статус);
    ЗаписьJSON.ЗаписатьИмяСвойства("year_status"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.ГОД_Статус);
    ЗаписьJSON.ЗаписатьИмяСвойства("week_status"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.НЕДЕЛЯ_Статус);
    ЗаписьJSON.ЗаписатьИмяСвойства("zn_type"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.СсылкаТипЗаказНаряда));
    ЗаписьJSON.ЗаписатьИмяСвойства("emp_dep"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.СотрудникПодр));
    ЗаписьJSON.ЗаписатьИмяСвойства("model_type"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.СсылкаОбъектОФт1кТСиОборудованиеуатМодельВидМоделиТС));
    ЗаписьJSON.ЗаписатьИмяСвойства("in_bounds"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.ВГраницеОтбора);
    ЗаписьJSON.ЗаписатьИмяСвойства("defekt_type"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.ДокументОснованиешхКлассификаторДефекта));
    ЗаписьJSON.ЗаписатьИмяСвойства("defect_desc"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.ДокументОснованиет1кОписание));

    // Новые поля
    ЗаписьJSON.ЗаписатьИмяСвойства("owner_dep"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.Подразделение));
    ЗаписьJSON.ЗаписатьИмяСвойства("TekStatusPoDoc"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.СтатусДок));
    ЗаписьJSON.ЗаписатьИмяСвойства("vehicle_group"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.т1кГруппаТехники));
    ЗаписьJSON.ЗаписатьИмяСвойства("vehicle_number"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.т1кГаражныйНомер));
    ЗаписьJSON.ЗаписатьИмяСвойства("hourdlit"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.ДлительностьЧасы);
    ЗаписьJSON.ЗаписатьИмяСвойства("MadeYear"); ЗаписьJSON.ЗаписатьЗначение(Формат(лВыборка.т1кГодВыпуска, "ДФ=yyyy-MM-ddTHH:mm:ss"));
    ЗаписьJSON.ЗаписатьИмяСвойства("Sektor"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.т1кСектор));
    ЗаписьJSON.ЗаписатьИмяСвойства("cost_parts"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.СтоимостьМатериалов);
    ЗаписьJSON.ЗаписатьИмяСвойства("cost_Trudozatrat"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.ЧасыТрудозатрат);
    ЗаписьJSON.ЗаписатьИмяСвойства("ts"); ЗаписьJSON.ЗаписатьЗначение(Строка(лВыборка.ОбъектОФ));

    Если ЗначениеЗаполнено(лВыборка.ЗНЗакрыт) Тогда
        ЗаписьJSON.ЗаписатьИмяСвойства("zn_closed"); ЗаписьJSON.ЗаписатьЗначение(Формат(лВыборка.ЗНЗакрыт, "ДФ=yyyy-MM-ddTHH:mm:ss"));
    Иначе
        ЗаписьJSON.ЗаписатьИмяСвойства("zn_closed"); ЗаписьJSON.ЗаписатьЗначение(Неопределено); // Запишет null в JSON, если пусто
    КонецЕсли;

    ЗаписьJSON.ЗаписатьИмяСвойства("odometer"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.Спидометр);
    ЗаписьJSON.ЗаписатьИмяСвойства("engine_hours"); ЗаписьJSON.ЗаписатьЗначение(лВыборка.СчетчикМЧ);

    ЗаписьJSON.ЗаписатьКонецОбъекта();
КонецЦикла;

ЗаписьJSON.ЗаписатьКонецМассива();
ЗаписьJSON.Закрыть();

Возврат Новый Структура("Данные, Количество", Поток.ЗакрытьИПолучитьДвоичныеДанные(), КоличествоЗаписей);

КонецФункции